src/InformationRegisters/ЗначенияДополнительныхПравПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияДополнительныхПравПользователя</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПраваПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Право</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПраваПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЗначенияДополнительныхПравПользователя/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;

	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.Значение <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// приводим запись к нужному типу
		Запись.Значение = Запись.Право.ТипЗначения.ПривестиЗначение(Запись.Значение);

	КонецЦикла;

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Перем ОбновлятьЗначениеГлПеременной;
	
	КэшДополнительныхПрав = глЗначениеПеременной("ЗначенияДополнительныхПравПользователя");
	УправлениеПользователями.ИнформироватьОИзмененииНастроекПравАктивныхПользователей(ЭтотОбъект, 
																					  КэшДополнительныхПрав, 
																					  "Право",
																					  глЗначениеПеременной("глТекущийПользователь"), 
																					  "значения дополнительных прав",
																					  ОбновлятьЗначениеГлПеременной,
																					  Ложь);
																					  
	Если ОбновлятьЗначениеГлПеременной Тогда
		глЗначениеПеременнойУстановить("ЗначенияДополнительныхПравПользователя", КэшДополнительныхПрав, Истина);
	КонецЕсли;																						  

КонецПроцедуры
